from compiler import StringCompiler

"""
1) Алфавит лишний --
2) e-такты для цепочки (игнорируем не только стек, но и символ) --
3) управляющие символы вместо символа '\1' (напр. '\1') --
4) в ДМПА должны быть \r\n --
5) ДМПА должна выполнять первый этап трансляции (внедрить действия) --
"""

def main():
    with open('input.txt', 'r', encoding='utf-8') as f:
        input_string = f.read()
    print(input_string + '\n')

    transition_dict = {
        'headers': [
            (" \t\r\n", '\1'),
            ("abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ_", '\1'),
            ("0123456789", '\1'),
            ("=", '\1'),
            ("+-", '\1'),
            ("+*", '\1'),
            ("(", '\1'),
            (")", '+'),
            (".", '\1'),
            ("eE", '\1'),
            ("\0", '\0')
        ],
        'transitions': [ #  (состояние, укладка в стек, вызов действия)
        #   ' '         a-z          0-9         =          +-         +*          (         ) ,'+'        .         eE      HALT,'\0'
        [( 0, '\1'), ( 1, '\1'),     ( )   ,    ( )   ,     ( )   ,    ( )   ,     ( )   ,    ( )   ,     ( )   ,     ( )   , (99,'\1')], # q0
        [(11, '\1'), ( 1, '\1'), ( 1, '\1'), ( 2, '\1'),    ( )   ,    ( )   ,     ( )   ,    ( )   ,     ( )   ,     ( )   ,    ( )   ], # q1
        [( 2, '\1'), ( 9, '\1'), ( 3, '\1'),    ( )   ,     ( )   ,    ( )   ,  ( 2, '+'),    ( )   ,     ( )   ,     ( )   ,    ( )   ], # q2
        [(10, '\1'),    ( )   ,  ( 3, '\1'),    ( )   ,     ( )   , ( 2, '\1'),    ( )   , (10, '\1'), ( 4,'\1'), ( 6, '\1'), (99,'\1')], # q3
        [   ( )   ,     ( )   ,  ( 5, '\1'),    ( )   ,     ( )   ,    ( )   ,     ( )   ,    ( )   ,     ( )   ,     ( )   ,    ( )   ], # q4
        [(10, '\1'),    ( )   ,  ( 5, '\1'),    ( )   ,     ( )   , ( 2, '\1'),    ( )   , (10, '\1'),    ( )   , ( 6, '\1'), (99,'\1')], # q5
        [   ( )   ,     ( )   ,  ( 8, '\1'),    ( )   , ( 7, '\1'),    ( )   ,     ( )   ,    ( )   ,     ( )   ,     ( )   ,    ( )   ], # q6
        [   ( )   ,     ( )   ,  ( 8, '\1'),    ( )   ,     ( )   ,    ( )   ,     ( )   ,    ( )   ,     ( )   ,     ( )   ,    ( )   ], # q7
        [(10, '\1'),    ( )   ,  ( 8, '\1'),    ( )   ,     ( )   , ( 2, '\1'),    ( )   , (10, '\1'),    ( )   ,     ( )   , (99,'\1')], # q8
        [(10, '\1'), ( 9, '\1'), ( 9, '\1'),    ( )   ,     ( )   , ( 2, '\1'),    ( )   , (10, '\1'),    ( )   ,     ( )   , (99,'\1')], # q9
        [(10, '\1'),    ( )   ,      ( )   ,    ( )   ,     ( )   , ( 2, '\1'),    ( )   , (10, '\1'),    ( )   ,     ( )   , (99,'\1')], # q10
        [(11, '\1'),    ( )   ,  (11, '\1'), ( 2, '\1'),    ( )   , ( 2, '\1'),    ( )   , (10, '\1'),    ( )   ,     ( )   , (99,'\1')]  # q11
    ]}

    compiler = StringCompiler(transition_dict)
    result = compiler.compile(input_string)

    print(result)
    with open('output.txt', 'w', encoding='utf-8') as f:
        for item in result[2]:
            f.write(item + '\n') if result is not None else f.write('')
    # try:
    # except Exception as e:
    #     print(f"Ошибка работы программы: {e}")
    #     with open('output.txt', 'w', encoding='utf-8') as f:
    #         f.write(str(e))

if __name__ == '__main__':
    main()


