from compiler import StringCompiler

"""
1) Алфавит лишний --
2) e-такты для цепочки --
3) управляющие символы '\1' --
4) в ДМПА должны быть \r\n --
5) ДМПА должна выполнять первый этап трансляции (внедрить действия) --
"""

def main():
    with open('input.txt', 'r', encoding='utf-8') as f:
        input_string = f.read()
    print(input_string + '\n')

    transition_dict = {
        'headers': [
            (" \t\r\n", '\1'),
            ("abcdfghijklmnopqrstuvwxyzABCDFGHIJKLMNOPQRSTUVWXYZ_", '\1'),
            ("0123456789", '\1'),
            ("=", '\1'),
            ("+-", '\1'),
            ("-", '\1'),
            ("*", '\1'),
            ("(", '\1'),
            (")", '\1'),
            (".", '\1'),
            ("eE", '\1'),
            ("\0", '\1'),
            ("\1", '\0')
        ],
        'transitions': [ #  (состояние, укладка в стек, вызов действия)
        #   ' '         a-z          0-9        =           +           -          *          (          )           .           eE         _|_      '\1','\0'
        [( 0,'\1'),( 1,'\1',1),    ( )    ,    ( )   ,     ( )   ,     ( )   ,    ( )   ,    ( )   ,    ( )    ,    ( )    ,( 1,'\1',1), (99, '\1'),    ( )   ], # q0
        [(11,'\1'),( 1,'\1',1),( 1,'\1',1),( 2,'=',2),     ( )   ,     ( )   ,    ( )   ,    ( )   ,    ( )    ,    ( )    ,( 1,'\1',1),    ( )    ,    ( )   ], # q1
        [( 2,'\1'),( 9,'\1',1),( 3,'\1',1),    ( )   ,     ( )   ,     ( )   ,    ( )   , ( 2, '('),    ( )    ,    ( )    ,( 9,'\1',1),    ( )    ,    ( )   ], # q2
        [(10,'\1'),    ( )    ,( 3,'\1',1),    ( )   , ( 2,'+',5),     ( )   ,( 2,'*',5),    ( )   ,(10,'\1',4),( 4,'\1',1),( 6,'\1',1),(12,'\1',5),    ( )   ], # q3
        [   ( )   ,    ( )    ,( 5,'\1',1),    ( )   ,     ( )   ,     ( )   ,    ( )   ,    ( )   ,    ( )    ,    ( )    ,    ( )    ,    ( )    ,    ( )   ], # q4
        [(10,'\1'),    ( )    ,( 5,'\1',1),    ( )   , ( 2,'+',5),     ( )   ,( 2,'*',5),    ( )   ,(10,'\1',4),    ( )    ,( 6,'\1',1),(12,'\1',5),    ( )   ], # q5
        [   ( )   ,    ( )    ,( 8,'\1',1),    ( )   , (7,'\1',1), (7,'\1',1),    ( )   ,    ( )   ,    ( )    ,    ( )    ,    ( )    ,    ( )    ,    ( )   ], # q6
        [   ( )   ,    ( )    ,( 8,'\1',1),    ( )   ,     ( )   ,     ( )   ,    ( )   ,    ( )   ,    ( )    ,    ( )    ,    ( )    ,    ( )    ,    ( )   ], # q7
        [(10,'\1'),    ( )    ,( 8,'\1',1),    ( )   , ( 2,'+',5),     ( )   ,( 2,'*',5),    ( )   ,(10,'\1',4),    ( )    ,    ( )    ,(12,'\1',5),    ( )   ], # q8
        [(10,'\1'),( 9,'\1',1),( 9,'\1',1),    ( )   , ( 2,'+',5),     ( )   ,( 2,'*',5),    ( )   ,(10,'\1',4),    ( )    ,( 9,'\1',1),(12,'\1',5),    ( )   ], # q9
        [(10,'\1'),    ( )    ,    ( )    ,    ( )   , ( 2,'+',5),     ( )   ,( 2,'*',5),    ( )   ,(10,'\1',4),    ( )    ,    ( )    ,(12,'\1',5),    ( )   ], # q10
        [(11,'\1'),    ( )    ,    ( )    ,( 2,'=',2),     ( )   ,     ( )   ,( 2,'*',5),    ( )   ,    ( )    ,    ( )    ,    ( )    ,    ( )    ,    ( )   ], # q11
        [   ( )   ,    ( )    ,    ( )    ,    ( )   ,     ( )   ,     ( )   ,    ( )   ,    ( )   ,    ( )    ,    ( )    ,    ( )    ,    ( )    ,(99, '\1')]  # q12
    ]}

    compiler = StringCompiler(transition_dict)

    result = compiler.compile(input_string)
    print(result)
    with open('output.txt', 'w', encoding='utf-8') as f:
        # Записываем первый элемент (список словарей)
        for key, value in result[0].items():
            f.write(f'{value['Номер']}: Идентификатор: {key} - {value['Информация']} \n')

        # Записываем второй элемент (строку с инструкциями)
        f.write('\nНеоптимизированный код:\n' + result[1] + '\n')

        # Записываем третий элемент (None)
        f.write('\nОптимизированный код:\n' + result[2] + '\n')
    try:
        pass
    except Exception as e:
        print(f"Ошибка работы программы: {e}")
        with open('output.txt', 'w', encoding='utf-8') as f:
            f.write(str(e))

if __name__ == '__main__':
    main()


